package com.example.medialog.fragments.newslist

import android.os.Bundle
import android.os.Parcelable
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import androidx.compose.foundation.ExperimentalFoundationApi
import androidx.compose.foundation.Image
import androidx.compose.foundation.background
import androidx.compose.foundation.clickable
import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.fillMaxHeight
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.foundation.layout.padding
import androidx.compose.foundation.lazy.LazyColumn
import androidx.compose.foundation.lazy.items
import androidx.compose.material.Text
import androidx.compose.runtime.Composable
import androidx.compose.ui.Modifier
import androidx.compose.ui.graphics.Color
import androidx.compose.ui.platform.ComposeView
import androidx.compose.ui.res.painterResource
import androidx.compose.ui.text.TextStyle
import androidx.compose.ui.text.style.TextOverflow
import androidx.compose.ui.unit.dp
import androidx.fragment.app.Fragment
import androidx.navigation.findNavController
import androidx.navigation.fragment.navArgs
import com.example.medialog.R
import com.example.medialog.fragments.ToolbarWithMenu
import com.example.medialog.ui.theme.Teal200
import kotlinx.parcelize.Parcelize

@Parcelize
data class News(
    val title: String,
    val image: Int,
    val description: String,
    val isLessons: Boolean
) : Parcelable

class NewListFragment : Fragment() {
    private val args: NewListFragmentArgs by navArgs()

    @OptIn(ExperimentalFoundationApi::class)
    override fun onCreateView(
        inflater: LayoutInflater, container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View {
        return ComposeView(requireContext()).apply {
            setContent {
                Column(
                    modifier = Modifier
                        .fillMaxHeight()
                        .fillMaxWidth()
                        .background(Teal200)
                ) {
                    ToolbarWithMenu(
                        if (args.isNews) {
                            "Media News"
                        } else {
                            "Text Lessons"
                        }
                    ) {
                        requireActivity().onBackPressed()
                    }
                    val newList: ArrayList<News> = ArrayList(5)
                    val lessonsList: ArrayList<News> = ArrayList(10)
                    lessonsList.add(
                        News(
                            title = "Ի՞նչ է սոցիալական մեդիան",
                            image = R.drawable.news1,
                            description = "• Սոցիալական մեդիա տերմինը վերաբերում է համակարգչային տեխնոլոգիային, որը հեշտացնում է գաղափարների, մտքերի և տեղեկատվության փոխանակումը վիրտուալ ցանցերի և համայնքների միջոցով: Սոցիալական մեդիան հիմնված է ինտերնետի վրա և օգտատերերին տալիս է բովանդակության արագ էլեկտրոնային հաղորդակցություն, ինչպիսիք են անձնական տվյալները, փաստաթղթերը, տեսանյութերը և լուսանկարները: Օգտատերերը սոցիալական մեդիայի հետ համագործակցում են համակարգչի, պլանշետի կամ սմարթֆոնի միջոցով՝ վեբ վրա հիմնված ծրագրաշարի կամ հավելվածների միջոցով: Թեև սոցիալական մեդիան ամենուր տարածված է Ամերիկայում և Եվրոպայում, ասիական երկրները, ինչպիսին Ինդոնեզիան է, գլխավորում են սոցիալական լրատվամիջոցների օգտագործման ցուցակը:2021 թվականի հոկտեմբերի դրությամբ ավելի քան 4,5 միլիարդ մարդ օգտվում է սոցիալական ցանցերից։Ամենամեծ սոցիալական ցանցերը ներառում են Facebook, Instagram, Twitter, YouTube և TikTok:Սոցիալական մեդիան առաջացել է որպես ընկերների և ընտանիքի հետ շփվելու միջոց, սակայն ավելի ուշ ընդունվել է այն բիզնեսների կողմից, որոնք ցանկանում էին օգտվել հաղորդակցման հանրաճանաչ նոր մեթոդից՝ հաճախորդներին հասնելու համար: Սոցիալական մեդիայի ուժը Երկրի վրա գտնվող որևէ մեկի կամ շատ մարդկանց հետ միաժամանակ միացնելու և տեղեկատվության փոխանակման կարողությունն է:\n" +
                                    "\n" +
                                    "\n" +
                                    "Սոցիալական մեդիայի տեսակները \n" +
                                    "\n" +
                                    "Սոցիալական մեդիան կարող է ունենալ տարբեր տեխնոլոգիական գործողությունների ձև: Այս գործողությունները ներառում են լուսանկարների փոխանակում, բլոգերներ, սոցիալական խաղեր, սոցիալական ցանցեր, տեսանյութերի փոխանակում, բիզնես ցանցեր, վիրտուալ աշխարհներ, ակնարկներ և շատ ավելին: Նույնիսկ կառավարությունները և քաղաքական գործիչները օգտագործում են սոցիալական մեդիան՝ ընտրողների և ընտրողների հետ շփվելու համար:Բիզնեսի համար սոցիալական մեդիան անփոխարինելի գործիք է: Ընկերություններն օգտագործում են հարթակը հաճախորդներին գտնելու և նրանց հետ շփվելու, գովազդի և առաջխաղացման միջոցով վաճառքը խթանելու, սպառողների միտումները գնահատելու և հաճախորդների սպասարկում կամ աջակցություն առաջարկելու համար: \n" +
                                    "\n" +
                                    "Սոցիալական մեդիայի դերը բիզնեսին օգնելու գործում նշանակալի է: Այն հեշտացնում է հաճախորդների հետ հաղորդակցությունը՝ հնարավորություն տալով միաձուլել սոցիալական փոխազդեցությունները էլեկտրոնային առևտրի կայքերում: Տեղեկատվություն հավաքելու նրա կարողությունն օգնում է կենտրոնանալ շուկայավարման ջանքերի և շուկայի հետազոտության վրա:\n" +
                                    "2021 թվականի հունվարի դրությամբ ամենահայտնի սոցիալական մեդիայի կայքերի թվերը հետևյալն են.\n" +
                                    "• Facebook (2,74 միլիարդ օգտատեր) \n" +
                                    "\n" +
                                    "• YouTube (2,29 միլիարդ օգտատեր) \n" +
                                    "\n" +
                                    "• WhatsApp (2 միլիարդ օգտատեր) \n" +
                                    "\n" +
                                    "• Facebook Messenger (1,3 միլիարդ օգտատեր) \n" +
                                    "\n" +
                                    "• Instagram (1,22 միլիարդ օգտատեր) \n" +
                                    "\n" +
                                    "• WeChat (1,21 միլիարդ օգտատեր) \n" +
                                    "\n" +
                                    "• TikTok (689 միլիոն օգտատեր) \n" +
                                    "\n" +
                                    "• QQ (617 միլիոն օգտատեր) \n" +
                                    "\n" +
                                    "• Douyin (600 միլիոն օգտատեր) \n" +
                                    "\n" +
                                    "• Sino Weibo (511 միլիոն օգտատեր)",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Ի՞նչ է լուրը",
                            image = R.drawable.news2,
                            description = "Արդի հայերենի բացատրական բառարանում « լուր» բառի բացատրությունն է ՝\n" +
                                    "Լուր- Հաղորդում մեկի կամ մի բանի մասին, տեղեկություն, խոսք ու զրույց, խոսակցություն, ոչ պաշտոնական կամ չստուգված տեղեկություն:Լրագրության տեսանկյունից լուրի համընդհանուր ու դասական սահմանում չկա: Շվեդ լրագրող, «Լրագրության 10 պատվիրան» գրքի հեղինակ Էրիկ Ֆիխթելիուսը գրում է. « Լուրերը զգացմունքային ընկալումն ու ավանդական պատկերացումներն են՝հավասար համամասնությամբ: Փորձառու լրագրողըշատ հաճախ կարող է կռահել, որ իր լսածը կամ տեսածը լավ լուրի հատկանիշներ է պարունակում»:\n" +
                                    "Խնդիրն այն է, որ լուրը անհատական է: Մենք, ըստ էության, խոսում ենք իրադարձության, մարդկանց կյանքում կատարված կամ կատարվելիք փոփոխությունների մասին: Ինչ-որ բան, որ արդեն եղել է, դեռ ընթացքի մեջ է, կամ էլ սպասվում է: Օրինակ՝այն, որ Նյու Յորքի մետրոյի գծերից մեկը ժամանակավորապես չի աշխատելու, լուր է Նյու Յորքի բնակիչների համար, սակայն Երեւանում այդ տեղեկությունն ընդհանրապես կարեւոր չէ: Մյուս կողմից՝այն, որ Հայաստանում, օրինակ, բուհերում սովորողները բանակ են զորակոչվելու, լուր է հայաստանցիների, բայց ոչ այլ երկրների բնակիչների համար: Իհարկե այստեղ էլ բացառություններ կան. արտերկրում բնակվող հայաստանցիներին հետաքրքիր են Հայաստանում զինապարտության խնդիրները:Կան միջազգային լուրեր, որոնք գործնականում հետաքրքիր են մոլորակի գրեթե ողջ բնակչության համար: Օրինակ՝ինքնաթիռի աղետը, երկրաշարժը, կոռուպցիոն մեծ սկանդալը, ճանաչված մարդկանց կյանքը։\n" +
                                    "\n" +
                                    "Ինչու՞է լրագրությունը կարեւոր\n" +
                                    "Վերադառնալով լուրի սահմանմանը՝պետք է կրկնենք, որ լուրի պարզ սահմանում չկա: Խմբագրություններն իրենք են գնահատում և ընտրում այն իրադարձությունները, որոնք կարող են լուր դառնալ: \n" +
                                    "Լուրի ամենակարեւոր հատկանիշը թարմությունն է. լուրը շուտ փչացող կամ մաշվող «ապրանք» է և որքան թարմ է, այնքան ավելի արժեքավոր է: Խմբագրություններն են ընտրում, թե որ իրադարձությունը կարող է լուր դառնալ, և ընտրության չափանիշները սրանք են՝ \n" +
                                    "\n" +
                                    "• տեղեկություն կամ իրադարձություն երկրի,քաղաքի ներսում,\n" +
                                    "• տեղեկություն կամ իրադարձություն, որն առնչվում է մեծ թվով մարդկանց ու կարևոր է նրանց համար,\n" +
                                    "• մինչ այդ անհայտ փաստ կամ երևույթ,\n" +
                                    "• սենսացիոն կամ արտասովոր տեղեկություն,\n" +
                                    "• հանրային անձանց մասին տեղեկություն:\n" +
                                    "Կարևոր է գիտակցել, որ լուրն «ապրանք» է, որն «արտադրում» և \n" +
                                    "«վաճառում» են տարբեր  սեփականատերերի պատկանող  լրատվամիջոցները։Դրանք\n" +
                                    "բոլորն ունեն իրենց քաղաքական կամ տնտեսական շահերը, ու դրանցից կախված՝մի իրադարձությունը կարող է դառնալ լուր, իսկ մյուսը՝ոչ: Լրատվամիջոցները հիմնականում շահույթ հետապնդող ընկերություններ են, որոնք երբեմն առաջնություն են տալիս այն լուրերին,որոնք շատ քլիք ու դիտում կբերեն։Լսարանի կարծիքը արժեւորող լրատվամիջոցների խմբագրական քաղաքականությունը թափանցիկ է: Այդպիսի խմբագրություններն ունեն աշխատանքային ուղեցույցներ ու մասնագիտական էթիկայի կանոնագրեր, որոնցում նաև բացատրված են իրենց աշխատանքի \n" +
                                    "սկզբունքները,այդ թվում ՝ լուրերի ընտրության չափանիշները։Այդ փաստաթղթերը սովորաբար հանրային են։Օրինակ՝ շվեդական «Էխո» խմբագրության աշխատանքային սկզբունքներում նշված է. « Մենք հաղորդում ենք այն ամենը, ինչ կարեւոր է: Այսինքն՝այն, ինչը նշանակալի է և կարող է ազդել շատերի վրա: Տեղեկատվությունը, որ մենք հաղորդում ենք, պետք է լինի ճշմարտացի և կարեւոր:Մենք պետք է հետևողականորեն լուսաբանենք նաև բարդ, հաճախ՝ընկալման համար դժվարամատչելի երեւույթները»։\n" +
                                    "Որպես հնարավոր սահմանում՝օգտագործենք Բիլ Կովաչի և Թոմ Ռոզենշթայլի «Լրագրության հիմունքները» գրքից այս մեջբերումը. «Լրագրության առաջնահերթ նպատակը քաղաքացիներին ազատ և ինքնիշխան լինելու համար անհրաժեշտ տեղեկատվությամբ ապահովելն է»:Որքան ազատ եւ ուժեղ են լրատվամիջոցները, այնքան հասարակությունն ավելի տեղյակ է երկրում կատարվող իրադարձություններին, այնքան մարդիկ ավելի ներգրավված են քաղաքական ու քաղաքա-ցիական գործընթացներում և մասնակցում են որոշումների ընդունմանը։",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Կիբեռհանցագործություն կամ համակարգչային հանցավորություն",
                            image = R.drawable.news3,
                            description = "Կիբեռհանցագործություն կամ համակարգչային հանցավորություն֊հանցագործություն է, որը ներառում է համակարգիչներ և համակարգչային ցանցեր։ Համակարգիչը կարող է օգտագործվել հանցագործության կատարման մեջ, կամ դա կարող է լինել թիրախ։ Կիբերհանցագործությունը կարող է սահմանվել այսպես՝ «վնասներ, որոնք ուղղված են անձի կամ անձանց խմբերին, որոնք ենթարկվում են քրեական դրդապատճառի` դիտավորությամբ վնաս հասցնելու զոհի հեղինակությանը կամ ֆիզիկական կամ հոգեկան վնասներ, ուղղակի կամ անուղղակիորեն օգտագործելով ժամանակակից հեռահաղորդակցային ցանցերը, ինչպիսիք են Ինտերնետը (ցանցերը, ներառյալ՝ զրուցարաններ, նամակներ, ծանուցման խորհուրդներ և խմբակներ) և բջջային հեռախոսներ (Bluetooth / SMS / MMS) »: Կիբերհանցագործությունը կարող է սպառնալ մարդուն կամ ազգի անվտանգությանը և ֆինանսական առողջությանը։ \n" +
                                    "\n" +
                                    "Կիբերանվտանգությունը արդի աշխարհի կարևորագույն հարցերից մեկն է, քանի որ աշխարհում լայն տարածում է գտել տեղեկատվական տեխանլոգիաների կիրառումը տարբեր տիպի հիմնախնդիրների լուծման համար։ Եվ դրան զուգահեռ աստիճանաբար աճում է կիբեռհարձակումների ենթարկվելու հավանականությունը։ \n" +
                                    "\n" +
                                    "Կիբերհանցագործներ \n" +
                                    "\n" +
                                    "Կիբեռհանցագործները ազգային համակարգերի, անհատների, խմբերի կամ կազմակերպությունների կողմից օգտագործվող վտանգավոր խմբեր կամ անհատներ են, որոնց գործունեությունը նպատակաուղղված է համակարգչային տեղեկատվական համակարգերը, ենթակառուցվածքները, համակարգչային ցանցերը և անհատական համակարգչային սարքերը վնասելուն, որը արվում է տարբեր միջոցներով, սովորաբար անանուն աղբյուրներից և գողացվում, փոխվում կամ ոչնչացվում է որոշակի ինֆորմացիա։ \n" +
                                    "\n" +
                                    "Կիբերհարձակվող խմբավորումներ \n" +
                                    "\n" +
                                    "Կիբերհարձակվող խմբավորումները կարելի է բաժանել մի քանի դասի. \n" +
                                    "\n" +
                                    "• «Սև գլխարկ» հաքերներ, որոնք աշխատում են պատվերով և իրականացնում են ցանկացած տիպի հարձակում։ \n" +
                                    "\n" +
                                    "• Պետական հաքերներ, որոնք իրականացնում են հարձակումներ պետական պատվերով։ \n" +
                                    "\n" +
                                    "• Այլ երկրի պետական կառույցների հաքերներ, որոնք իրականացնում են գործողություններ հակառակորդ երկրի բնակչության կամ կազմակերպության դեմ։ \n" +
                                    "\n" +
                                    "• Կիբեռլրտեսներ, որոնք աշխատում են մեծ կազմակերպությունների և կազմակերպված հանցավոր խմբերի համար։ \n" +
                                    "\n" +
                                    "• Կիբեռահաբեկիչներ, որոնք իրականացնում են առցանց ահաբեկչություններ։ \n" +
                                    "\n" +
                                    "• Հաքտիվիստներ, քաղաքական, կրոնական կամ հասարակական ոլորտներում գործող ակտիվիստներ, որոնք իրենց բողոքն արտահայտում են հաքերային հարձակումների միջոցով։ \n" +
                                    "\n" +
                                    "Ո՞վ կարող է դառնալ հարձակման թիրախ \n" +
                                    "\n" +
                                    "Այսօր գրեթե յուրաքանչյուր մարդ կարող է դառնալ հարձակման թիրախ, ինչի պատճառով կիբեռպաշտպանությունը յուրաքանչյուրի համար կարևոր է դառնում։ Կիբեռվտանգների մեծ մասից կարելի է խուսափել մի շարք պայմանների հետևելով։ Դրանք ներառում են համակարգչի, հեռախոսի, հաշիվների պաշտպանությանը վերաբերող\n" +
                                    "քայլեր։",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Ինչ է Ֆիշինգը",
                            image = R.drawable.news4,
                            description = "Ֆիշինգը տեխնիկա է, որը փորձում է ձեռք բերել անձնական տվյալներ, ինչպիսիք են բանկային հաշիվների համարները,անձնական էջերի մուտքանուններն ու գաղտնաբառերը էլեկտրոնային փոստի կամ վեբկայքում կեղծ միջնորդության միջոցով, որում հանցագործը ներկայացվում է որպես օրինական բիզնես ունեցող անձ ։ Ըստ 2020 թվականի Proofpoint-ի կատարած ուսումնասիրության՝ կազմակերպությունների 90% -ը 2019 թվականին ենթարկվել է ֆիշինգի։ Իսկ Verizon Data Breach Investigations-ի 2019 թվականի հետազոտությունը ցույց է տվել, որ ֆիշինգի 94% -ը կատարվում է էլեկտրոնային փոստի միջոցով։ Ֆիշինգի հարձակումները կարող են կործանարար լինել ինչպես աշխատակիցների, այնպես էլ ձեռնարկությունների համար։ Ըստ Verizon-ի տվյալների՝ 2019 թվականին տվյալների գողության 32%-ը կապված է եղել ֆիշինգի հետ։  \n" +
                                    "\n" +
                                    "Ֆիշինգ հարձակման տեսակները \n" +
                                    "\n" +
                                    "Գոյություն ունեն ֆիշինգ հարձակման տարբեր տեսակներ։ Այն կարող է լինել նպատակային հարձակում՝ ուղղված կոնկրետ անձի, ընկերության կամ որևէ շրջանակի մարդկանց։ \n" +
                                    "\n" +
                                    "Էլեկտրոնային փոստի ֆիշինգ \n" +
                                    "\n" +
                                    "Էլփոստի ֆիշինգը (անգլ․՝ Email phishing)  ֆիշինգի ամենատարածված տեսակն է, և այն կիրառվում է 1990-ականներից։ Հաքերներն ուղարկում են նամակներ ցանկացած էլփոստի հասցեով։ Էլեկտրոնային փոստը սովորաբար տեղեկացնում է ձեզ, որ ձեր հաշվի հետ խնդիրներ են առաջացել և որ դուք պետք է անմիջապես արձագանքեք՝ անցնելով տրված հղմամբ։ Այս հարձակումները հիմնականում հեշտ է նկատել, քանի որ էլփոստի լեզուն հաճախ պարունակում է ուղղագրական և/կամ քերականական սխալներ։ Սակայն որոշ նամակներ դժվար է ճանաչել որպես ֆիշինգ հարձակումներ, երբ լեզուն և քերականությունը ավելի մանրակրկիտ են մշակված։ \n" +
                                    "\n" +
                                    "Նիզակային ֆիշինգ \n" +
                                    "\n" +
                                    "Նիզակային ֆիշինգը (անգլ․՝ Spear phishing)  ֆիշինգի մեթոդ է, որը թիրախավորում է որոշակի անհատներ կամ խմբեր կազմակերպության ներսում։ Սա ֆիշինգի հզոր տարբերակ է, որն օգտագործում է էլ. փոստերը, սոցիալական մեդիան և այլ հարթակներ՝ օգտատերերին ստիպելու հրապարակել անձնական տեղեկություններ կամ կատարել գործողություններ, որոնք հանգեցնում են տվյալների կամ ֆինանսական կորստի։ Էլեկտրոնային փոստը ներառում է թիրախին հատուկ տեղեկատվություն, այդ թվում՝ թիրախի անունը և վարկանիշը ընկերության ներսում։ Սոցիալական ինժեներական այս մարտավարությունը մեծացնում է հավանականությունը, որ զոհը կիրականացնի վարակվելու համար անհրաժեշտ բոլոր գործողությունները, ներառյալ բացել էլ.փոստը և հավելվածը։ Նիզակային ֆիշինգը բացառիկ վտանգ է ստեղծել նույնիսկ անվտանգության համակարգը վերահսկողների համար։ \n" +
                                    "\n" +
                                    "Վիշինգ \n" +
                                    "\n" +
                                    "Վիշինգը կամ Ձայնային ֆիշինգը (անգլ․՝ vishing or voice phishing)  տեղի է ունենում, երբ կիբերհանցագործը զանգահարում է և ստեղծում հրատապության զգացում, որը ստիպում է մարդուն կատարել քայլ իր շահերի դեմ։ Այս զանգերը սովորաբար տեղի են ունենում սթրեսային ժամանակաշրջաններում։ Քանի որ զանգը խուճապի և հրատապության զգացում է առաջացնում, զոհը կարող են խաբվել՝ տրամադրելով անձնական տվյալները։ \n" +
                                    "\n" +
                                    "Կետերի որս \n" +
                                    "\n" +
                                    "Կետերի որսը (անգլ․՝ whaling) շատ նման է նիզակային ֆիշինգին, բայց ընկերության որևէ աշխատակցի թիրախավորելու փոխարեն խաբեբաները հատուկ թիրախավորում են բարձրաստիճան ղեկավարներին (կամ «մեծ ձկներին», որտեղից էլ կետերի որս տերմինը)։ Սա ներառում է գործադիր տնօրենին կամ որևէ բարձրաստիճան աշխատակցի, որն ավելի կարևոր տվյալների հասանելիություն ունի, քան հասարակ աշխատակիցները։ Հաճախ այդ նամակները ստեղծում են բարձր ճնշման իրավիճակ իրենց զոհերին խաբելու համար, օրինակ դատի տված ընկերության հայտարարության։ Սա դրդում է զոհերին անցնել հղմամբ՝ լրացուցիչ տեղեկություններ իմանալու համար։ \n" +
                                    "\n" +
                                    "Սմիշինգ \n" +
                                    "\n" +
                                    "Սմիշինգը (անգլ․՝ Smishing ) «ՍՄՍ» և «ֆիշինգ» բառերի կոմբինացիան է, խաբեության տեսակ, որտեղ խաբեբաները բջջային հեռախոսով տեքստային հաղորդագրություններ են ուղարկում՝ նշելով բացել հղումը։ Սովորաբար, տեքստային հաղորդագրություններեւմ նշված է, որ դրանք այնպիսի կարևոր կազմակերպությունից են, ինչպիսիք են ձեր բանկը, ծառայություններ մատուցողը, բջջային հեռախոսակապի ընկերությունը։ \n" +
                                    "\n" +
                                    "Սոցիալական մեդիայի ֆիշինգ \n" +
                                    "\n" +
                                    "Սոցիալական մեդիայի ֆիշինգն (անգլ․՝ Social media phishing) հարձակման այն մեթոդն է, երբ հարձակվողները օգտագործում են սոցիալական կայքեր, ինչպիսիք են Facebook-ը, Twitter-ը և Instagram-ը, զոհերի տվյալները ձեռք բերելու համար՝ հղմամբ անցնելու դեպքում։ Հարձակվողները կարող են կեղծ հաշիվներ ստեղծել ՝ նմանակելով մեկին, ում զոհը ճանաչում է, որպեսզի վերջինիս գցեն իրենց ծուղակը։ Նրանք նույնիսկ կարող են ներկայանալ հայտնի ապրանքանիշների հաշիվներով։",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Պայքար ֆիշինգի դեմ",
                            image = R.drawable.news5,
                            description = "Գոյություն ունեն ֆիշինգի դեմ պայքարի տարբեր միջոցներ, ներառյալ՝ օրենսդրական միջոցներ և հատուկ ստեղծված պաշտպանիչ կայքեր։ \n" +
                                    "\n" +
                                    "Օգտատերերի ուսուցում \n" +
                                    "\n" +
                                    "Ֆիշինգի դեմ պայքարը կայանում է նրանում, որ մարդկանց պետք է սովորեցնել տարբերակել ֆիշինգը նրա դեմ պայքարից։ Մարդիկ կարող են  նվազեցնել խաբվելու վտանգը, մի քիչ փոխելով իրենց վարքագիծը։ \n" +
                                    "\n" +
                                    "Գրեթե բոլոր վավերական հաղորդագրությունները  իրենց մեջ պարունակում են մի հիշատակում, որը անհասանելի է ֆիշինգիստներին։ Ոմանք, օրինակ, PayPal-ը միշտ դիմում է իր հասցեատերերին անուններով, իսկ ընդհանուր ուղերձում գրում են «PayPal-ի հարգելի հաճախորդ» կարող է դիտարկվել որպես ֆիշինգային փորձ։ \n" +
                                    "\n" +
                                    "Վարկային կազմակերպությունների և բանկերի նամակները իրենց մեջ հաճախ պարունակում են հաշվեհամարների մի մասը։  \n" +
                                    "\n" +
                                    "Անտիֆիշինգային աշխատանքների խումբը, գտնում է, որ  ֆիշինգի սովորական մեթոդները շուտով կդառնան ոչ այնքան կիրառելի։ \n" +
                                    "\n" +
                                    "Տեխնիկական մեթոդները \n" +
                                    "\n" +
                                    "Դիտարկիչները նախազգուշական վտանգի մասին \n" +
                                    "\n" +
                                    "Ֆիշինգի  պայքարի դեմ այլ ուղղություններից  է ֆիշինգային կայքերի ցուցակի ստեղծումը։ Նման համակարգեր գոյություն ունեն Internet Explorer, Mozilla Firefox, Google Chrome, Safari և Opera։ \n" +
                                    "\n" +
                                    "Firefox-ը օգտագործում է Google-ի անտիֆիշինգային  համակարգը։  Opera օգտագործում է PhishTank և GeoTrust  սև ցուցակները։  \n" +
                                    "2006  թվականին հայտնվել է հատուկ DNS-սերվերները։\n" +
                                    "\n" +
                                    "\n" +
                                    "Ինչպես ճանաչել ֆիշինգը \n" +
                                    "\n" +
                                    "Հետաքննությունների դաշնային բյուրոյի (այսուհետ՝ ՀԴԲ) ինտերնետային հանցագործության դեմ բողոքների կենտրոնը հայտնում է, որ մարդիկ մեկ տարվա ընթացքում շուրջ 57 մլն դոլար են կորցրել ֆիշինգի պատճառով։ Ֆիշինգ-կայքերի հայտնաբերումը և կանխարգելումը կարևոր քայլ է օգտատերերին պաշտպանելու համար։ Գոյություն ունեն ֆիշինգի դեմ պայքարի մի շարք մարտավարություններ և մեթոդներ։ Սակայն հարց է առաջանում․ ինչպե՞ս պաշտպանվել ֆիշինգից և ինչի՞ն մեծ ուշադրություն հատկացնել։ \n" +
                                    "\n" +
                                    "• Նամակներ, որոնք պահանջում են անհապաղ գործողություններ \n" +
                                    "\n" +
                                    "• Քերականական և ուղղագրական սխալներ պարունակող նամակներ \n" +
                                    "\n" +
                                    "• Որևէ խնդրին լուծում առաջարկող անհայտ աղբյուրով նամակներ \n" +
                                    "\n" +
                                    "• Էլփոստի հասցեի, հղումների և տիրույթի անունների անհամապատասխանություններ ունեցող նամակներ \n" +
                                    "\n" +
                                    "• Կասկածելի կցորդներ (անգլ․՝ attachments) պարունակող նամակներ \n" +
                                    "\n" +
                                    "• Նամակներ, որոնք պահանջում են մուտքանուններ, գաղտնաբառեր կամ վճարման տվյալներ \n" +
                                    "\n" +
                                    "• Ճշմարիտ լինելու համար չափազանց լավ նամակներ \n" +
                                    "\n" +
                                    "Ինչպես պաշտպանվել ֆիշինգից \n" +
                                    "\n" +
                                    "Էլփոստի սպամ բաժինը կարող է շատ ֆիշինգ նամակներ պարունակել։ Բայց խաբեբաները միշտ փորձում են շրջանցել սպամի ֆիլտրերը, ուստի կարևոր է ունենալ լրացուցիչ պաշտպանություն։ Ահա չորս քայլ, որոնք անհրաժեշտ է ձեռնարկել՝ պաշտպանվելու ֆիշինգ հարձակումներից։ \n" +
                                    "\n" +
                                    "• Պաշտպանեք ձեր համակարգիչը՝ օգտագործելով անվտանգության ծրագրեր \n" +
                                    "\n" +
                                    "• Պաշտպանեք ձեր բջջային հեռախոսը՝ ծրագրային ապահովման ավտոմատ թարմացման կարգավորումով \n" +
                                    "\n" +
                                    "• Պաշտպանեք ձեր հաշիվները՝ օգտագործելով բազմագործոն նույնականացում \n" +
                                    "\n" +
                                    "• Պաշտպանեք ձեր տվյալները՝ կրկնօրինակելով դրանք այլ վայրում:",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Սոցիլական մեդիայի վտանգները",
                            image = R.drawable.news6,
                            description = "Սոցիալական ցանցերը շատ դռներ են բացում, կապ են ստեղծում աշխարհի հետ, օգնում են հաղորդակցվել, համագործակցել, ստեղծագործել․․․ Սոցցանցերում շատ են նաև կեղծիքը, բացասական բովանդակությունը, խաբեությունը․․․ \n" +
                                    "\n" +
                                    "Ինչպես օֆլայն կյանքում, առցանց միջավայրում էլ կան կանոններ․ եթե ճանապարհ անցնելիս երեխային սովորեցնում ենք նայել լուսացույցին ու հետևել կանոններին, օնլայն տիրույթում էլ կարևոր է իմանալ ու նաև երեխաներին բացատրել «օնլայն երթևեկության» կանոնները։ \n" +
                                    "\n" +
                                    "Սոցցանցերի դեպքում պետք է սկսել տարիքային սահմանափակումներից․ դրանք հիմնականում թույլ են տալիս օգտահաշիվ բացել 13 տարեկանից։ Դրանից հետո էլ ծնողները կարող են օգտվել վերահսկողության մեխանիզմներից, ակտվիացնել սահմանափման կարգավորումներ։ Բայց ամենակարևորը՝ պետք է խոսել երեխայի հետ, հարցեր տալ և քննարկել ու միասին որոշել կանոնները։  \n" +
                                    "\n" +
                                    "Օրինակ՝ շփվել միայն մարդկանց հետ, ում իրականում ճանաչում ես, չտարածել բաներ, որոնք չէիր ուզենա ցույց տալ ուսուցչին կամ ծնողին, չգրել անձնական տեղեկություններ (ծննդյան օրը, բնակության վայր, հեռախոսահամար), տարօրինակ, վիրավորական նամակներ ստանալու դեպքում միշտ ցույց տալ մեծահասակին և այլն․․․․ \n" +
                                    "\n" +
                                    "Ավստրալիական Raising Children Network ցանցն առանձնացնում է հետևյալ վտանգները․ \n" +
                                    "\n" +
                                    "• Տարիքին անհամապատասխան, ագրեսիվ, բացասական, սեռական բնույթի բովանդակության հանդիպելը, \n" +
                                    "\n" +
                                    "• Երեխաների կողմից տհաճ, պրովոկացիոն, տարիքին անհամապատասխան նկարների ու տեսանյութերի տարածելը, \n" +
                                    "\n" +
                                    "• Անձնական տեղեկություններ տարածելը, \n" +
                                    "\n" +
                                    "• Կիբերբուլինգը, \n" +
                                    "\n" +
                                    "• Չափից շատ թիրախավորված գովազդի ազդեցությունը, \n" +
                                    "\n" +
                                    "• Հարթակների կողմից երեխայի տվյալների օգտագործումը։ \n" +
                                    "\n" +
                                    "Ամերիկյան Common Sense Media-ն խորհուրդներ է պատրաստել ծնողների համար, որոնցից առանձնացրել ենք մի քանիսը։ \n" +
                                    "\n" +
                                    "⇒Գովազդներ և գնումներ հավելվածների ներսում   \n" +
                                    "\n" +
                                    "Անվճար հավելվածները ինչ-որ կերպ պետք է եկամուտ ստանան: Որոշ հավելվածներ հետևում են ձեր գնումներին և առաջարկում թիրախավորված գովազդներ, իսկ որոշ հավելվածներ նույնիսկ ունեն թիրախավորված զրուցարաններ (chat), ինչը նշանակում է, որ ձեր երեխային հրավիրում են զրուցարան ինչ-որ մեկի հետ, ով փորձում է որոշակի ապրանք վաճառել:  \n" +
                                    "\n" +
                                    "Ի՞նչ անել. Իմացեք, թե ինչ կա հավելվածում և սահմանաչափ դրեք գնումների վրա: Ստուգեք ձեր երեխաներին հանդիպող գովազդների տեսակները, բացատրեք, թե ինչ է գովազդը և ինչու են իրենց փորձում այս կամ այն ապրանքը վաճառել։ Հուշեք, թե ինչ կարող են անել, եթե ստանում են նման նամակներ։ \n" +
                                    "\n" +
                                    "⇒Տարիքին անհամապատասխան բովանդակություն \n" +
                                    "\n" +
                                    "Ընկերները կարող են բաց տեսարաններով կիսվել միմյանց հետ հաղորդագրությունների միջոցով (օրինակ՝ սեռական բնույթի հաղորդագրություններ (sexting))։ Բայց որոշ ցանցերում (Յություբ, Տիկտոկ) երեխան կարող է բախվել իր տարիքին անհամապատասխան բովանդակության, անգամ եթե իր սոցցանցային ընկերները չեն տարածել այն։ \n" +
                                    "\n" +
                                    "Ի՞նչ անել։ Հարցրեք ձեր երեխային, թե ում է նա հետևում և խնդրեք ցույց տալ, թե ինչ գրառումներ են արվում: Ինքներդ օգտագործեք հավելվածը և պատկերացում կազմեք, թե հիմնականում ինչ է հայտնվում լրահոսում: Այնուհետև փորձեք փնտրել ձեզ մտահոգող բովանդակությունը և պարզել, թե որքանով է հեշտ այն գտնել: Ստուգեք օգտագործման պայմանները՝ պարզելու, թե հավելվածը ինչ է թույլատրում, և արդյոք օգտատերերը կարող են բողոքել կանոնների խախտման դեպքում:\t\n" +
                                    "\n" +
                                    "\n" +
                                    "⇒Անանունություն \n" +
                                    "\n" +
                                    "Անանունությունը ոչ միշտ, բայց հաճախ դաժանություն է ծնում: Մարդիկ կարծում են, որ եթե անանուն են, իրենց մեկնաբանություններն անհետևանք են մնալու և իրենք կարող են վիրավորել ուրիշներին։ \n" +
                                    "\n" +
                                    "Անանունության դրական կողմն այն է, որ դեռահասները մնալով անանուն կարողանում են խոսել զգայուն կամ ցավոտ խնդիրներից, ստանալ օգնություն և աջակցություն:   \n" +
                                    "\n" +
                                    "Ի՞նչ անել. Համոզվեք, որ ձեր դեռահաս երեխան հասկանում է ռիսկերը, բացատրեք նրանց, թե ինչու է պետք խուսափել անանուն մարդկանց հետ շփվելուց և ինչու է կարևոր օգտագործել իրական անունն ու դեմքը։ Կարևոր է, որ երեխան պատասխանատվություն զգա ինչպես օֆլայն, այնպես էլ օնլայն գործողությունների համար։ \n" +
                                    "\n" +
                                    "Վստահություն ձևավորեք, ստեղծեք միջավայր, երբ երեխան խնդիրների դեպքում կդիմի ձեզ, ոչ թե անանուն ծանոթներին։ Իսկ եթե դժվարանում է ծնողի հետ խոսել որոշ խնդիրների մասին, կարևոր է, որ երեխայիշրջապատում լինեն այլ վստահելի մեծահասակներ, ում հետ նա կանկեղծանա։ Նաև կարևոր է, որ երեխան տեղյակ լինի, թե ինչ կարող է անել կիբերբուլինգի՝ օնլայն ծաղրի ու վիրավորանքի դեպքում։ Հիշեք, որ սոցցանցային հարթակներն էլ ունեն բողոքի հնարավորություն։   \n" +
                                    "⇒Տեղորոշում \n" +
                                    "\n" +
                                    "Ուր էլ որ գնաք, ձեր սոցիալական մեդիայի հավելվածները դա գիտեն: Թեև դուք կարող եք ձեր անձնական էջում նշել միայն քաղաքը և շրջանը, տեղորոշման թույլտվություն տալը հաճախ նշանակում է, որ ձեզ հետևում են քաղաքի թաղամասի ճշգրտությամբ և ձեր հրապարակումները կարող են ներառել ձեր գտնվելու վայրի մասին տեղեկություն:    \n" +
                                    "\n" +
                                    "Ի՞նչ անել։ Անջատեք գտնվելու վայրի կարգավորումները հեռախոսում և հավելվածում: Ստուգեք՝ արդյո՞ք նախկին գրառումները պարունակում են գտնվելու վայրի մասին տեղեկատվություն, և ջնջեք այն: \n" +
                                    "\n" +
                                    "⇒Հրապարակումների գաղտնիություն \n" +
                                    "\n" +
                                    "Սովորաբար սոցցանցերում օգտատերն էլ ընտրում, թե ում է հասանելի հրապարակումը՝ իրեն, ընկերներին, միայն որոշակի մարդկանց, բոլորին․․․ Որոշ հավելվածներու, սակայն, սկզբնական կարգավորումներով գրառումները հրապարակային են, ինչը նշանակում է, որ երեխայի անունը, նկարը հասանելի են բոլորին: \n" +
                                    "\n" +
                                    " Ի՞նչ անել։Հավելվածը ներբեռնելուց անմիջապես հետո մտեք կարգավորումներ և ստուգեք սկզբնական կարգավորումները: Եթե երեխան նույն ծրագիրն օգտագործում է նաև բրաուզերով, ապա այնտեղ նույնպես ստուգեք:",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Ի՞նչ  է կիբեռպատերազմը",
                            image = R.drawable.news7,
                            description = "Կիբեռպատերազմ կամ կիբեռնետիկական պատերազմ֊ (անգլ.՝ cyberwarfare, ֆր.՝ cyberguerre, գերմ.՝ Cyberkrieg, ռուս.՝ кибервойна) հակամարտություն, պատերազմ, դիմակայություն է կիբեռնետիկ տարածությունում (կիբեռտարածություն), այդ թվում՝ համակարգչային դիմակայություն Համացանցում և հանդիսանում է տեղեկատվական պատերազմի տարատեսակներից մեկը։\n" +
                                    "Կիբեռնետիկական պատերազմը ուղղված է նախ և առաջ համակարգչային համակարգերի անկայունացմանը, պետական հաստատությունների, ֆինանսական և գործարար կենտրոնների համացանց մուտք գործելուն և ամենօրյա կյանքում համացանցի վրա հենվող երկրների ու պետությունների կյանքում անկարգության ու քաոսի ստեղծմանը։ Միջպետական հարաբերությունները և քաղաքական դիմակայությունը հաճախ իրենց շարունակությունն են գտնում համացանցում կիբեռպատերազմի և նրա բաղկացուցիչ մասերի տեսքով՝ վանդալիզմ, քարոզչություն, լրտեսություն, անմիջական հարձակումներ համակարգային ցանցերի և սերվերների վրա և այլն։ \n" +
                                    "\n" +
                                    "Պատմություն \n" +
                                    "\n" +
                                    "Կիբեռպատերազմ տերմինի սահմանումներից մեկը հետևյալ տեսքն ունի. «„կիբեռպատերազմը“ համացանցի և նրա հետ կապված տեխնոլոգիական ու տեղեկատվական միջոցների օգտագործումն է մի պետության կողմից՝ մյուս պետության ռազմական, տեխնոլոգիական, տնտեսական, քաղաքական, տեղեկատվական անվտանգությանը և ինքնիշխանությանը վնաս հասցնելու նպատակով:» \n" +
                                    "\n" +
                                    "ԱՄՆ կառավարության անվտանգության փորձագետ Ռիչարդ Քլարքն իր «Կիբեռպատերազմ» (անգլ.՝ CyberWarfare) գրքում գրել է (լույս է տեսել 2010 թվականին) «Կիբեռպատերազմը մի ազգային պետության գործողություններն են՝ թափանցելու մեկ այլ ազգային պետության համակարգիչների կամ ցանցերի մեջ՝ վնաս հասցնելու կամ ավերելու նպատակով»։ Բրիտանական The Economist հանդեսը կիբեռտարածությունը նկարագրում է որպես «պատերազմի հինգերորդ բնագավառ, ցամաքից, ծովից, օդից և տիեզերքից հետո»։ Մոտավորապես նույն կերպ հարցի մասնագետներից մեկը՝ Շեյն Հարիսը կիբեռտարածությունում մղվող պատերազմը անվանում է պատերազմի հինգերորդ ռազմաբեմ։ \n" +
                                    "\n" +
                                    "Կիբեռտարածությունում ռազմական գործողությունների իրականացման ուղղությամբ առաջին քայլերը ձեռնարկվել են 2000-ական թվականների սկզբներին։ Կազմավորվել են. \n" +
                                    "\n" +
                                    "• 2005 թվականին՝ Եվրամիության ցանցային և տեղեկատվական անվտանգության գործակալությունը \n" +
                                    "\n" +
                                    "• 2010 թվականին՝ ԱՄՆ-ի կիբեռնետիկական հրամանատարություն \n" +
                                    "\n" +
                                    "Բնութագրիչ հատկանիշները \n" +
                                    "\n" +
                                    "Համակարգչային տեխնոլոգիաների տարածման հետ միասին բազում քաղաքացիներ, ձեռնարկություններ և պետական հաստատություններ ամենօրյա կյանքում և գործունեության մեջ հայտնվեցին Համացանցից կախվածության վիճակի մեջ։ Համացանցի օգտագործումը՝ այլ պետության համակարգչային համակարգերի վրա հարձակման համար կարող է նշանակալից վնաս հասցնել հարձակման ենթարկված պետության տնտեսությանը և խառնակ, իսկ երբեմն էլ՝ քաոսային իրավիճակ ստեղծել այդ երկրի ամենօրյա կյանքում։ Ի տարբերություն անցյալի կիբեռ-գրոհների այժմ կիբեռպատերազմը իրենից ներկայացնում է սպառնալիք երկրի ազգային անվտանգության համար և շատերի կողմից ընկալվում է որպես պետության անվտանգության լուրջ սպառնալիք։ \n" +
                                    "\n" +
                                    "Բացի այդ, շատ պետությունների հետախուզական ծառայություները համացանցում զբաղվում են լրտեսությամբ։ Մասնավորապես՝ տեղեկատվություն են հավաքում, կոտրում են այլ պետությունների համակարգչային ցանցերը, ծավալում դիվերսիոն գործունեություն և տնտեսական լրտեսություն։ Հայտնի է, որ Չինաստանին մեղադրում էին ԱՄՆ-ի, Գերմանիայի, Հնդկաստանի համացանացային կայքերի նկատմամբ հարձակումներ կազմակերպելու համար։ Չինաստանը, սակայն ժխտում է իր պետական հաստատությունների մասնակցությունը համացանցային գրոհների կազմակերպման մեջ: \n" +
                                    "\n" +
                                    "Նոր տեխնոլոգիաների զարգացման կապակցությամբ՝ կիբեռպատերազմի մակարդակը մշտապես կատարելագործվում է։ \n" +
                                    "\n" +
                                    "Որոշ պետություններ սկսում են անհրաժեշտ ուշադրություն դարձնել կիբեռպատերազմի դեմ պաշտպանության ստեղծմանը, մասնավորապես՝ հատկացնում են համապատասխան միջոցներ՝ կիբեռպատերազմի դեմ պաշտպանական համակարգի ստեղծման համար և պահում են հատուկ ստորաբաժանումներ, որոնց հիմնական խնդիրը երկրի համացանցային անվտանգության համակարգի կատարելագործումն է և դրանց պաշտպանությունը հարձակումներից։",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Ի՞նչ է կիբեռլրտեսությունը",
                            image = R.drawable.news8,
                            description = "Կիբեռլրտեսությունը (անգլ.՝ Cyber spying, ռուս.՝ Кибершпионаж), կամ համակարգչային լրտեսությունը, որը անվանում են նաև կիբեռհետախուզություն կամ կիբեռնետիկական հետախուզություն, տերմին է, որը, որպես կանոն, նշանակում է չարտոնված կամ չթույլատրված մուտք համակարգիչների մեջ՝ անձնական, տնտեսական, քաղաքական կամ ռազմական գերազանցություն ստանալու նպատակով, ինչը կատարվում է համակարգչային անվտանգության համակարգերի շրջանցմամբ կամ կոտրմամբ, կիրառելով վնասակար ծրագրեր, ներառյալ՝ «տրոյական ձիեր» և լրտեսական ծրագրեր։ Կիբեռլրտեսությունը կարող է իրականացվել թե՛ հեռավար (դիստանցիոն) ձևով՝ Համացանցի օգտագործմամբ, այնպես էլ սովորական լրտեսների («խլուրդների»), այնպես էլ հաքերների կողմից՝ ձեռնարկությունների և կազմակերպությունների համակարգիչների և ցանցային համակարգերի մեջ ներթափանցմամբ։ \n" +
                                    "\n" +
                                    "Փաստացի, կիբեռլրտեսությունը կիբեռպատերազմի հիմնական երկու տեսակներից մեկն է։ \n" +
                                    "\n" +
                                    "Ոչ շատ վաղ ժամանակներից կիբեռլրտեսությունը ներառում է նաև հատուկ ծառայությունների կողմից այնպիսի սոցիալական ցանցերի օգտատերերի վարքի վերլուծությունը, ինչպիսիք են օրինակ Ֆեյսբուքը և Թվիթթերը՝ նպատակ ունենալով ի հայտ բերել ծայրահեղական, ահաբեկչական և հակակառավարական գործունեությունը։ \n" +
                                    "\n" +
                                    "Որպես կանոն, կիբեռլրտեսության գործողություններն ապօրինի են զոհ-երկրում, միևնույն ժամանակ ագրեսոր-երկրում դրանք աջակցություն են ստանում իշխանության ամենաբարձր մակարդակներում։ Չինաստանի կողմից ԱՄՆ-ի դեմ կիբեռլրտեսության դեպքերի հայտնաբերումից հետո, Կոմունիկատիվ (հաղորդակցային) քաղաքական հետազոտությունների ինստիտուտի աշխատակից Ամիտայ Էտցիոնին առաջարկեց Չինաստանին և ԱՄՆ-ին մշակելու կիբեռտարածությունում փոխադարձ երաշխավորված զսպության քաղաքականություն։ Այդպիսի քաղաքականությունը թույլ կտար երկու կողմերին՝ այնպիսի միջոցներ ձեռնարկել, որոնք իրենք անհրաժեշտ կհամարեն իրենց ինքնապաշտպանության համար, միաժամանակ համաձայնվելով ձեռնպահ մնալու հարձակողական գործողություններից (կիբեռհարձակումներ) կամ միմյանց դեմ կիբեռլրտեսության կազմակերպումից, ինչը պետք է ապահովվի համապատասխան ստուգումների մեխանիզմով։",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Համակարգչային անվտանգություն",
                            image = R.drawable.news9,
                            description = "Համակարգչային անվտանգությունը, կիբերանվտանգությունը[1] կամ Տեղեկատվական տեխնոլոգիաների անվտանգությունը (ՏՏ անվտանգություն) համակարգչային համակարգերի պաշտպանությունն է, դրանց ապարատային, ծրագրային ապահովման կամ էլեկտրոնային տվյալները գողությունից, ինչպես նաև իրենց մատուցած ծառայությունների խաթարումից կամ սխալից զերծ պահելու միջոցն է։ \n" +
                                    "\n" +
                                    "Կիբերանվտանգության դաշտը դառնում է ավելի կարևոր՝համակարգչային համակարգերի, ինտերնետի[2] և անլար ցանցային ստանդարտների, ինչպիսիք են Bluetooth- ը և Wi-Fi- ը ՝ կախվածությունը մեծացնելու պատճառով, և« խելացի »սարքերի, այդ թվում ՝ սմարթֆոնների, հեռուստացույցների և այլ սարքավորումների աճի շնորհիվ։ Սարքեր, որոնք կազմում են «իրերի ինտերնետ»։ Շնորհիվ իր բարդության, ինչպես քաղաքականության, այնպես էլ տեխնոլոգիական առումով, կիբերանվտանգությունը նաև ժամանակակից աշխարհի գլխավոր մարտահրավերներից մեկն է։ \n" +
                                    "\n" +
                                    "Տեղեկատվական անվտանգության մշակույթԽմբագրել \n" +
                                    "\n" +
                                    "Աշխատակիցների պահվածքը կարող է մեծ ազդեցություն ունենալ կազմակերպություններում տեղեկատվական անվտանգության վրա։ Մշակութային հասկացությունները կարող են օգնել կազմակերպության տարբեր հատվածներին արդյունավետ աշխատել կամ աշխատել կազմակերպության ներսում տեղեկատվական անվտանգությանն ուղղված արդյունավետության դեմ։ Տեղեկատվական անվտանգության մշակույթը «... կազմակերպությունում վարքագծի օրինակների ամբողջականությունն է, որոնք նպաստում են բոլոր տեսակի տեղեկատվության պաշտպանությանը»[12]։ \n" +
                                    "\n" +
                                    "Անդերսոնը և Ռեյմերսը (2014) պարզեցին, որ աշխատակիցները հաճախ իրենց չեն տեսնում որպես կազմակերպության տեղեկատվական անվտանգության «ջանքերի» մաս և հաճախ այնպիսի գործողություններ են ձեռնարկում, որոնք անտեսում են կազմակերպչական տեղեկատվական անվտանգության լավագույն շահերը[13]։ [19] Հետազոտությունները ցույց են տալիս, որ տեղեկատվական անվտանգության մշակույթը պետք է շարունակաբար բարելավվի։ «Տեղեկատվական անվտանգության մշակույթը վերլուծությունից մինչև փոփոխություն», հեղինակները մեկնաբանել են. «Դա անվերջ գործընթաց է, գնահատման և փոփոխության կամ պահպանման ցիկլի անվտանգություն»։ Տեղեկատվական անվտանգության մշակույթը կառավարելու համար պետք է կատարվի հինգ քայլ ՝ նախնական գնահատումը,ռազմավարական պլանավորումը,օպերատիվ պլանավորում,իրականացում,հետագա գնահատում[14]։ \n" +
                                    "\n" +
                                    "• Նախաարդյունավետություն. Աշխատողների ներսում տեղեկատվական անվտանգության իրազեկվածության նույնականացումը և անվտանգության ներկայիս քաղաքականությունը վերլուծելը։ \n" +
                                    "\n" +
                                    "• Ռազմավարական պլանավորում. Ավելի լավ իրազեկման ծրագիր մշակելու համար անհրաժեշտ է հստակ նպատակներ սահմանել։ \n" +
                                    "\n" +
                                    "• Օպերատիվ պլանավորում. Անվտանգության լավ մշակույթ կարող է ստեղծվել `հիմնվելով ներքին հաղորդակցության, կառավարման-գնման և անվտանգության իրազեկվածության և ուսումնական ծրագրի վրա։ \n" +
                                    "\n" +
                                    "• Իրականացում. Տեղեկատվական անվտանգության մշակույթը կյանքի կոչելու համար պետք է օգտագործվի չորս փուլ։ Դրանք են՝ \n" +
                                    "\n" +
                                    "•     Կառավարման հանձնառություն \n" +
                                    "\n" +
                                    "•     Հաղորդակցություն կազմակերպչական անդամների հետ \n" +
                                    "\n" +
                                    "•     Դասընթացներ կազմակերպական բոլոր անդամների համար \n" +
                                    "\n" +
                                    "•     Աշխատակիցների պարտավորություն[15] \n" +
                                    "\n" +
                                    "• Հետագնահատում. Գնահատել պլանավորման և իրականացման հաջողությունները, ինչպես նաև բացահայտել անհանգստության չլուծված ոլորտները։",
                            isLessons = true
                        )
                    )
                    lessonsList.add(
                        News(
                            title = "Հարձակումներ համակարգերի վրա",
                            image = R.drawable.news10,
                            description = "Համակարգչային համակարգը ապահովելու համար անհրաժեշտ է հասկանալ այն գրոհները, որոնք կարող են իրականացվել դրա դեմ, և այդ սպառնալիքները, որպես կանոն, կարելի է դասակարգել ստորև նշված կատեգորիաներից որևէ մեկի մեջ. \n" +
                                    "\n" +
                                    "Backdoor \n" +
                                    "\n" +
                                    "Համակարգչային համակարգում, թաքնված համակարգում, ալգորիթմում թիկունքը հանդիսանում է նորմալ վավերացման կամ անվտանգության վերահսկողությունները շրջանցելու գաղտնի ցանկացած մեթոդ։ Դրանք կարող են գոյություն ունենալ մի շարք պատճառներով, ներառյալ բնօրինակը ձևավորմամբ կամ վատ կազմաձևերով։ Դրանք կարող են ավելացվել է լիազորված անձի կողմից թույլատրելի ինչ-որ օրինական մուտք, կամ հարձակվողի կողմից վնասակար պատճառներով. բայց անկախ նրանց գոյության դրդապատճառներից ՝ նրանք խոցելիություն են ստեղծում։ \n" +
                                    "\n" +
                                    "DoS հարձակում \n" +
                                    "\n" +
                                    "DoS (անգլ.՝ Denial of Service - ծառայության ժխտում) հաքերային հարձակում է համակարգչային համակարգի վրա, որտեղ հարձակվողները (հակերները) փորձում են կանխել օրինական օգտագործողների մուտք դեպի ծառայություն։ Ներկայում Dos հարձակումները ամենատարածվածներից են, քանի որ նրանք թույլ են տալիս խափանել գրեթե ցանկացած համակարգ՝ թողնելով իրավաբանորեն ոչ համապատասխան ապացույցներ։ Եթե հարձակումը կատարվում է ոչ թե մի կամ ոչ շատ կետերից այլ բազմաթիվ կետերից, ապա այդ դեպքում գրոհը DDos է։ \n" +
                                    "\n" +
                                    "Գաղտնալսում \n" +
                                    "\n" +
                                    "Գաղտնալսում (անգլ.՝ Eavesdropping), մարդկանց հաղորդակցության, հեռախոսային, մասնավոր համակարգչի «խոսակցություն» (հաղորդակցություն) լողալիս լսելն է, որը սովորաբար գտնվում է ցանցում գտնվող հաղորդավարների միջև։ Ինչպիսիք ենCarnivore- ը և NarusInSight- ը, որոնք օգտագործվում են FBI-ի և NSA- ի կողմից, ինտերնետ-ծառայություններ մատուցողների համակարգերի գաղտնալսման համար։ Նույնիսկ մեքենաներ, որոնք գործում են որպես փակ համակարգ (այսինքն ՝ առանց արտաքին աշխարհի հետ կապ չունենալու) կարող են գաղտնալսվել ապարատային սարքավորումներով առաջացած թույլ էլեկտրամագնիսական փոխանցումները դիտարկելու միջոցով. TEMPEST- ը ԱԱԾ-ի կողմից ներկայացվող ճշգրտում է, որը վերաբերում է այս հարձակումներին։ \n" +
                                    "\n" +
                                    "Սպամ \n" +
                                    "\n" +
                                    "Սպամի ամենաանմեղ տարբերակը էլեկտրոնային փոստի անցանկալի հաղորդագրություններն են։ Սպամը կարող է լինել վտանգավոր, երբ կիրառվում է ֆիշինգ պատերազմներում կամ եթե պարունակում է հղում վարակված կայքէջերին, որոնք ներբեռնում են վիրուսները, որդերը և տրոյական ծրագրերը զոհի համակարգչի մեջ։ \n" +
                                    "\n" +
                                    "Ֆիշինգ \n" +
                                    "\n" +
                                    "  նպատակն է ստանալ որևէ սոցիալական կայքի օգտատիրոջ[6] գաղտնի տվյալները, ծածկագիրը և ծածկանունը։ Սա կատարվում է զանգվածային  էլեկտրոնային սպամ նամակների միջոցով, որոնք հասցեատիրոջը  հասնում են հայտնի բրենդների անունից, ինչպես նաև տարբեր ծառայությունների վերաբերյալ անձնական նամակներ, օրինակ բանկի կամ սոցիալական ցանցերի կողմից։ Նամակը հաճախ պարունակում է ուղղակի կայքի հղումը, որը արտաքնապես չի տարբերվում իրական նույն կայքից։ Այն բանից հետո, երբ  հաղորդագրության օգտատերը ստանում է կեղծ էջը, հաքերները տարբեր հոգեբանական հնարքներով փորձում են դրդել օգտատիրոջը մուտք գործել կեղծ էջ՝ իրենց իրական մուտքանունը և գաղտնաբառը  լրացնելով, որը հաքերներին թույլ է տալիս մուտք գործել դեպի օգտատիրոջ բանկային հաշիվ կամ ակաունտ։ \n" +
                                    "\n" +
                                    "Ստեղնաշարային լրտես \n" +
                                    "\n" +
                                    "Ստեղնաշարային լրտեսը վնասատու ծրագիր է, որը արձանագրում է յուրաքանչյուր ստեղնի սեղմումը։ Այսպիսի ծրագրերը օգտագործում են գաղտնի տվյալներ` գաղտնաբառերի, բանկային հաշվեհամարների և դրանց կոդերի, կրեդիտ քարտերի ծածկագրերը կորզելու համար։ \n" +
                                    "\n" +
                                    "Spyware \n" +
                                    "\n" +
                                    "Լրտեսածրագիրը (spyware) այն ծրագիրն է, որը անհատական համակարգչի մեջ տեղադրվում է գաղտնի կերպով՝ տվյալ համակարգչի աշխատանքը խոչընդոտելու կամ դրա օգտագործողի ու տվյալ համակարգչի շփման մասնակի ղեկավարումը ստանձնելու նպատակով, առանց օգտագործողին այդ մասին տեղեկացնելու։ \n" +
                                    "\n" +
                                    "Լրտեսածրագրերը կարող են հավաքել տարբեր տեսակի անձնական տեղեկություններ, օրինակ՝ համացանցում շրջելու սովորությունների, այցելված կայքերի մասին, ինչպես նաև՝ կարող են ազդել օգտագործողի համակարգչի կառավարմանը այլ ձևերով, օրինակ՝ հավելյալ ծրագրեր տեղադրելով և վերահասցեագրելով դիտման համակարգի գործողությունները։ Լրտեսածրագրերը նաև կարող են փոխել համակարգչի գործունեության պայմանները՝ առաջացնելով կապի արագության նվազում, փոխելով սկզբնական էջերը, և համացանցի հետ կապի կամ այլ ծրագրերի ֆունկցիաների կորուստ։\n" +
                                    "\n" +
                                    "\n" +
                                    "\n" +
                                    "Կորզող ծրագրեր\n" +
                                    "Տրոյական կորզող ծրագրերը նախատեսված են գումար կորզելու համար։ Սովորաբար այդպիսի տրոյական ծրագիրը կամ ծածկագրում է զոհի տվյալները նրա համակարգչի կոշտ սկավառակի վրա, կամ համակարգիչը դարձնում է անհասանելի։ Դրանից հետո կորզիչ ծրագիրը այդ փոփոխությունները վերացնելու համար գումար է պահանջում։ \n" +
                                    "\n" +
                                    "Նպատակային գրոհ \n" +
                                    "\n" +
                                    "Նպատակային գրոհը հանդիսանում է անձի կամ անձանց կողմից հաճախակի կազմակերպված համակարգչային հաքերային գործընթացների շարք։ Նպատակային գրոհը սովորաբար թիրախավորում է կամ մասնավոր կազմակերպություններին, պետություններին կամ երկուսին միասին, բիզնեսի կամ քաղաքական դրդապատճառների համար։ Նպատակային գրոհի գործընթացները պահանջում են գաղտնիության բարձր աստիճան` երկարատև ժամանակահատվածում։ \n" +
                                    "\n" +
                                    "Ջրային փոս \n" +
                                    "\n" +
                                    "Ջրային փոսը (Watering hole) դա համակարգչային հարձակման ռազմավարությունն է, որտեղ թիրախ է հանդիսանում որոշակի խումբ (կազմակերպություն, արդյունաբերություն կամ տարածաշրջան)։ Այս հարձակման ժամանակ հարձակվողը հետևում է և կանխատեսում, թե ինչ վեբկայքերից է խումբը օգտվում և վնասակիր ծրագրով վարակում է մեկին կամ մի քանիսին։ \n" +
                                    "\n" +
                                    "Ֆարմինգ \n" +
                                    "\n" +
                                    "Ֆարմինգը կիբերհանցագործության այն տեսակն է, երբ զեղծարարները ստեղծում են կեղծ կայքեր, որտեղ մարդիկ սխալմամբ կայցելեն։ Դա կարող է տեղի ունենալ, օրինակ, իսկական կայքի հասցեն տպելիս սխալ թույլ տալու դեպքում։ Երբեմն զեղծարարներին հաջողվում է վերաուղղորդել իսկական կայքի այցելուներին իրենց ստեղծած կայք, ինչից հետո նրանք փորձում են գրանցել մուտքագրվող անձնական տվյալները։",
                            isLessons = true
                        )
                    )
                    newList.add(
                        News(
                            title = "Data Stealing",
                            image = R.drawable.lesson1,
                            description = "The China database leak could be one of the biggest ever recorded, cybersecurity experts say.\n" +
                                    "(CNN)A massive online database apparently containing the personal information of up to one billion Chinese citizens was left unsecured and publicly accessible for more than a year -- until an anonymous user in a hacker forum offered to sell the data and brought it to wider attention last week.\n" +
                                    "The leak could be one of the biggest ever recorded in history, cybersecurity experts say, highlighting the risks of collecting and storing vast amounts of sensitive personal data online -- especially in a country where authorities have broad and unchecked access to such data.\n" +
                                    "The vast trove of Chinese personal data had been publicly accessible via what appeared to be an unsecured backdoor link -- a shortcut web address that offers unrestricted access to anyone with knowledge of it -- since at least April 2021, according to LeakIX, a site that detects and indexes exposed databases online.\n" +
                                    "Access to the database, which did not require a password, was shut down after an anonymous user advertised the more than 23 terabytes (TB) of data for sale for 10 bitcoin -- roughly \$200,000 -- in a post on a hacker forum last Thursday.\n" +
                                    "The user claimed the database was collated by the Shanghai police and contained sensitive information on one billion Chinese nationals, including their names, addresses, mobile numbers, national ID numbers, ages and birthplaces, as well as billions of records of phone calls made to police to report on civil disputes and crimes.\n" +
                                    "A sample of 750,000 data entries from the three main indexes of the database was included in the seller's post. CNN verified the authenticity of more than two dozen entries from the sample provided by the seller, but was unable to access the original database.\n" +
                                    "The Shanghai government and police department did not respond to CNN's repeated written requests for comment.\n" +
                                    "The seller also claimed the unsecured database had been hosted by Alibaba Cloud, a subsidiary of Chinese e-commerce giant Alibaba. When reached by CNN for comment on Monday, Alibaba said \"we are looking into this\" and would communicate any updates. On Wednesday, Alibaba said it declined to comment.\n" +
                                    "But experts CNN spoke with said it was the owner of the data who was at fault, not the company hosting it.\n" +
                                    "\"As it stands today, I believe this would be the largest leak of public information yet -- certainly in terms of the breadth of the impact in China, we're talking about most of the population here,\" said Troy Hunt, a Microsoft regional director based in Australia.\n" +
                                    "China is home to 1.4 billion people, which means the data breach could potentially affect more than 70% of the population.\n" +
                                    "\"It's a little bit of a case where the genie is not going to be able to go back in the bottle. Once the data is out there in the form it appears to be now, there's no going back,\" said Hunt.\n" +
                                    "It is unclear how many people have accessed or downloaded the database during the 14 months or more it was left publicly available online. Two Western cybersecurity experts who spoke to CNN were both aware of the existence of the database before it was thrust into the public spotlight last week, suggesting it could be easily discovered by people who knew where to look.\n" +
                                    "Vinny Troia, a cybersecurity researcher and founder of dark web intelligence firm Shadowbyte, said he first discovered the database \"around January\" while searching for open databases online.\n" +
                                    "\"The site that I found it on is public, anybody (could) access it, all you have to do is register for an account,\" Troia said. \"Since it was opened in April 2021, any number of people could have downloaded the data,\" he added.\n" +
                                    "Troia said he downloaded one of the main indexes of the database, which appears to contain information on nearly 970 million Chinese citizens. But it was difficult to judge whether the open access was an oversight from the owners of the database, or if it was an intentional shortcut intended to be shared among a small number of people, he said.\n" +
                                    "\"Either they forgot about it, or they intentionally left it open because it's easier for them to access,\" he said, referring to the authorities responsible for the database. \"I don't know why they would. It sounds very careless.\"\n" +
                                    "Unsecured personal data -- exposed through leaks, breaches, or some form of incompetence -- is an increasingly common problem faced by companies and governments around the world, and cybersecurity experts say it is not unusual to find databases that are left open to public access.\n" +
                                    "In 2018, Trioa discovered that a Florida-based marketing firm exposed close to 2 TB of data that appeared to include personal information on hundreds of millions of American adults on a publicly accessible server, according to Wired.\n" +
                                    "In 2019, Victor Gevers, a Dutch cybersecurity researcher, found an online database containing names, national ID numbers, birth dates and location data of more than 2.5 million people in China's far-western region of Xinjiang, which was left unprotected for months by Chinese firm SenseNets Technology, according to Reuters.\n" +
                                    "But the latest data leak is particularly worrying, cybersecurity researchers say, not only because of its potentially unprecedented volume, but also the sensitive nature of the information contained.\n" +
                                    "A CNN analysis of the database sample found police records of cases spanning nearly two decades from 2001 to 2019. While the majority of the entries are civil disputes, there are also records of criminal cases ranging from fraud to rape.\n" +
                                    "In one case, a Shanghai resident was summoned by police in 2018 for using a virtual private network (VPN\u200B) to \u200Bevade China's firewall and access Twitter\u200B, allegedly retweeting \"reactionary remarks involving the (Communist) Party, politics and leaders.\"\n" +
                                    "In another record, a mother called the police in 2010, accusing her father-in-law of raping her 3-year-old daughter.\n" +
                                    "\"There could be domestic violence, child abuse, all sorts of things in there, that to me is a lot more worrying,\" said Hunt, the Microsoft regional director.\n" +
                                    "\"Might this lead to extortion? We often see extortion of individuals after data leaks, examples where hackers can even try to ransom individuals.\"\n" +
                                    "The Chinese government has recently stepped up efforts to improve protection of online user data privacy. Last year, the country passed its first Personal Information Protection Law, laying out ground rules on how personal data should be collected, used and stored. But experts have raised concerns that while the law can regulate technology companies, it could be challenging to enforce when applied to the Chinese state.\n" +
                                    "Bob Diachenko, a security researcher based in Ukraine, first came upon the database in April. In mid-June, his company detected that the database was attacked by an unknown malicious actor, who destroyed and copied the data and left a ransom note demanding 10 bitcoin for its recovery, Diachenko said.\n" +
                                    "It is not clear if this was the work of the same person who advertised the sale of the database information last week.\n" +
                                    "By July 1, the ransom note had disappeared, according to Diachenko, but only 7 gigabytes (GB) of data was available -- instead of the 23 TB originally advertised.\n" +
                                    "Diachenko said it suggested the ransom had been resolved, but the database owners had continued to use the exposed database for storing, until it was shut down over the weekend.\n" +
                                    "\"Maybe there was some junior developer who noticed it and tried to remove the notes before senior management noticed them,\" he said.\n" +
                                    "Shanghai Police did not respond to CNN's request for comments on the ransom note.\u2028\u2028This story has been updated with additional developments Wednesday.\n" +
                                    "CNN's Philip Wang contributed reporting.",
                            isLessons = false
                        )
                    )
                    newList.add(
                        News(
                            title = "Հեռախոսային խաբեբաները նոր ուղիներ են գտնում ավստրիացիներին խաբելու համար",
                            image = R.drawable.lesson2,
                            description = "10-րդ ավստրալացիներից մեկը ռմբակոծվում է պոտենցիալ խաբեբաների կողմից անհանգստացնող զանգերի ալիքով , ցույց է տվել նոր հետազոտությունը:\n" +
                                    "Ըստ Crime Stoppers NSW-ի, ավստրալացիների գրեթե 90 տոկոսը շաբաթական առնվազն մեկ անցանկալի զանգ է ստանում, իսկ մարդկանց 10 տոկոսը ամեն շաբաթ ենթարկվում է ավելի քան տասը զանգի:\n" +
                                    "NSW Crime Stoppers-ի ղեկավար Փիթեր Փրայսը նախազգուշացրել է, որ անհանգստացնող զանգի վրա անսովոր ուշացումն է անսովոր ուշացումը:\n" +
                                    "«Եթե նկատվում է հստակ ուշացում, երբ դուք վերցնում եք հեռախոսը, և անձը չի հայտնում, թե ով է նախքան խոսակցությունը սկսելը, պարզապես անջատեք», - ասաց նա:\n" +
                                    "«Հեռախոսը կախելը կարող է լինել խաբված լինելու կամ չխաբված լինելու տարբերությունը»:\n" +
                                    "Ավստրալիայի մրցակցության և սպառողների հանձնաժողովի Scamwatch-ը հայտնել է, որ հեռախոսազանգերը շարունակում են մնալ ամենատարածված ճանապարհը, որով խաբեբաները հասնում են սպառողներին՝ փորձելով կանխիկացնել թիրախներից:\n" +
                                    "2021 թվականին խարդախության հեռախոսազանգերը մինչ այժմ պատճառել են 66,8 միլիոն դոլարի ֆինանսական վնաս, ըստ Scamwatch-ի, որը հունվարի 1-ից հոկտեմբերի 3-ը ստացել է 120,279 հաղորդում:\n" +
                                    "2021 թվականի ցուցանիշները ներկայացնում էին կորուստների 104 տոկոս աճ և հաշվետվությունների 87 տոկոս աճ:\n" +
                                    "Crime Stoppers-ը զգուշացրել է, որ խաբեբաները նոր ուղիներ են գտնում մարդկանց խաբելու համար, որպեսզի նրանք ընդունեն իրենց զանգերը:\n" +
                                    "Զանգահարողի ID-ի կեղծումը մարտավարությունից մեկն է, որն օգտագործվում է խաբեբաների կողմից՝ իրենց ինքնությունը քողարկելու համար:\n" +
                                    "Եթե \u200B\u200Bխաբեբայը զանգում է Ավստրալիայից դուրս, նա կարող է ցուցադրել ավստրալական հեռախոսահամար, ներառյալ բջջային համարը, ինչը մեծացնում է ձեր զանգին պատասխանելու հավանականությունը:\n" +
                                    "Որոշ ավստրալացիներ նույնիսկ զանգեր են ստանում «իրենց» հեռախոսահամարից, ասաց պարոն Փրայսը:\n" +
                                    "\n" +
                                    "Մյուս ավստրալացիները հայտնում են, որ իրենց վավեր հեռախոսահամարները կապված են հեռախոսային խարդախության մեջ, քանի որ համարը գողացվել և օգտագործվել է հանցագործների կողմից:\n" +
                                    "Պարոն Փրայսը ասաց, որ մարդիկ պետք է անհապաղ կապ հաստատեն իրենց հեռահաղորդակցության մատակարարի հետ, եթե նրանց հեռախոսահամարը գողացվել և օգտագործվել է հեռախոսային խարդախության մեջ:\n" +
                                    "Հարցումը պարզել է, որ անցանկալի կամ անհանգստացնող զանգեր ստացողներից ավելի քան 68 տոկոսին խնդրել են վարկային քարտի կամ վճարման մանրամասների կամ իրենց համակարգչից օգտվելու համար:\n" +
                                    "Հարցվածների կեսից ավելին զբաղվել է անհանգստացնող զանգով, նախքան ի վերջո անջատելը:\n" +
                                    "Եվ դեպքերի հինգ տոկոսում մարդիկ տրամադրել են անձնական տվյալներ, կրեդիտ քարտի կամ վճարման մանրամասներ կամ մուտք գործել իրենց համակարգիչ:\n" +
                                    "«Լեգիտիմ հաստատությունը չի տա հետաքննող կամ անձնական հարցեր անկոչ զանգի ժամանակ», - ասաց պարոն Փրայսը:\n" +
                                    "«Հարցերը կարող են անվնաս թվալ, բայց դրանք կերտում են ձեր պատկերը, որտեղ են ձեր ֆինանսները, ձեր ֆինանսական վիճակը և այլ անձնական մանրամասներ, որոնք թույլ են տալիս անձնավորել ձեզ և գումար կորզել:\n" +
                                    "Եթե \u200B\u200Bինչ-որ մեկը հարցնում է ձեր անձնական տվյալները, պարզապես անջատեք հեռախոսը, ասաց պարոն Փրայսը:\n" +
                                    "«Լավագույն խորհուրդը, որը մենք կարող ենք տալ սպառողներին, պարզապես անջատելն է, այնուհետև ստուգել, \u200B\u200Bթե արդյոք զանգը օրինական է, զանգահարելով այն կազմակերպությանը, որտեղից նրանք պնդում են, որ իրենք են»",
                            isLessons = false
                        )
                    )
                    newList.add(
                        News(
                            title = "խարդախը կոտրել է Վիկտորիանական համալսարանի համակարգը",
                            image = R.drawable.lesson3,
                            description = "Գրեթե 47,000 ուսանողների տվյալները գողացել են այն բանից հետո, երբ խարդախը կոտրել է Վիկտորիանական համալսարանի համակարգը\n" +
                                    "13 հուլիսի, 2022 թ\n" +
                                    "Վիկտորիանական համալսարաններից մեկում տեղի ունեցած խոշոր կիբերհարձակման արդյունքում գողացվել են գրեթե 47,000 ներկա և նախկին ուսանողների կոնտակտային տվյալները , ինչպես նաև որոշ ուսանողների արդյունքները:\n" +
                                    "Դիքին համալսարանը հարձակման է ենթարկվել կիրակի օրը, երբ ինչ-որ մեկը կոտրել է անձնակազմի օգտանունն ու գաղտնաբառը՝ համալսարանի տեղեկատվությանը մուտք գործելու համար, որը պահվում է երրորդ կողմի մատակարարի կողմից:\n" +
                                    "Այնուհետ հաքերն օգտագործել է այդ տեղեկությունը՝ Դիքինից խաբեության տեքստ ուղարկելու համար 9997 ուսանողներին:\n" +
                                    "Յուրաքանչյուր ոք, ով սեղմում էր հղումը, տեղափոխվում էր մի ձև, որը պահանջում էր ստացողի տվյալները, ներառյալ վարկային քարտի տվյալները:\n" +
                                    "Հաքերը նաև ներբեռնել է Դիքինի 46980 ներկա և նախկին ուսանողների կոնտակտային տվյալները։\n" +
                                    "\n" +
                                    "\n" +
                                    "Դիքինի ուսանողներին ուղարկված խաբեության տեքստը համալսարանի համակարգը կոտրելուց հետո: (Տրամադրված)\n" +
                                    "Կոնտակտային տվյալները ներառում էին ուսանողի անունը, ուսանողի ID-ն, ուսանողի բջջային համարը, Դիքինի էլ.փոստի հասցեն և հատուկ մեկնաբանությունները, որոնք ներառում էին վերջին միավորի արդյունքները:\n" +
                                    "Դիքինի համալսարանը խորհուրդ է տվել «անհապաղ միջոցներ» ձեռնարկել՝ դադարեցնելու հաքերներին ուսանողներին հետագա տեքստեր ուղարկելը:\n" +
                                    "«Տվյալների խախտման վերաբերյալ հետաքննությունը անմիջապես սկսվել է», - ասվում է համալսարանի հայտարարության մեջ, որում խոստացել է աշխատել ապագա կիբերհարձակումները կանխելու համար:\n" +
                                    "«Դիքինը անկեղծորեն ներողություն է խնդրում այս միջադեպից տուժածներից և ցանկանում է վստահեցնել Դիքին համայնքին, որ մանրակրկիտ հետաքննություն է անցկացնում՝ նմանատիպ միջադեպի կրկնությունը կանխելու համար»:\n" +
                                    "Համալսարանն ասել է, որ կզեկուցի խախտման մասին և կառաջնորդվի Վիկտորիանական տեղեկատվության հանձնակատարի գրասենյակի կողմից (OVIC)», և որ «հետաքննում է միջադեպը և աշխատում է երրորդ կողմի մատակարարի հետ՝ ապահովելու անվտանգության արձանագրությունների բարելավումը կանխելու համար»: այս խախտման ցանկացած կրկնություն»:\n" +
                                    "Խարդախության տեքստը ստացած ուսանողներին խորհուրդ է տրվում փոխել իրենց Deakin գաղտնաբառը:",
                            isLessons = false
                        )
                    )
                    newList.add(
                        News(
                            title = "Ռուս հաքերները ենթադրաբար թիրախավորել են Ուկրաինայի խոշորագույն մասնավոր էներգետիկ ընկերությանը",
                            image = R.drawable.lesson4,
                            description = "7:04, 2 հուլիսի, 2022 թ\n" +
                                    "Ռուս հաքերները «կիբերհարձակում» են իրականացրել Ուկրաինայի խոշորագույն մասնավոր էներգետիկ կոնգլոմերատի վրա՝ ի պատասխան դրա սեփականատիրոջ՝ ուկրաինական պատերազմին ընդդիմանալու, ուրբաթ ասել է ընկերությունը։\n" +
                                    "DTEK Group-ը, որը տիրապետում է ածուխի և ջերմաէլեկտրակայաններին Ուկրաինայի տարբեր շրջաններում, ասել է, որ հաքերային հարձակման նպատակն է եղել «ապակայունացնել տեխնոլոգիական գործընթացները» իր բաշխման և արտադրող ընկերությունների, ընկերության գործունեության վերաբերյալ քարոզչություն տարածել և «ուկրաինացի սպառողներին լքել»: առանց էլեկտրականության»։\n" +
                                    "\n" +
                                    "\n" +
                                    "Հաքի իրական ազդեցությունը և համակարգչային որ համակարգերը խախտվել են, պարզ չէ:\n" +
                                    "Միջադեպի հետևանքով անջատումների մասին տեղեկություններ չկան։ DTEK-ը չի պատասխանել մեկնաբանության հարցումներին:\n" +
                                    "Հաքերային միջադեպը բացահայտվել է մի քանի օր անց այն բանից հետո, երբ Ուկրաինայի ամենահարուստ մարդը և DTEK-ի սեփականատեր Ռինատ Ախմետովը Ռուսաստանին դատի է տվել Մարդու իրավունքների եվրոպական դատարան՝ Ախմետովին միլիարդավոր դոլարների գույքային իրավունքների վնաս պատճառելու համար:\n" +
                                    "Ռուսալեզու հաքերային խումբը, որը հայտնի է XakNet անունով, պնդում էր, որ այս շաբաթ խախտել է DTEK-ի ցանցերը և որպես ապացույց Telegram հավելվածի սքրինշոթներ է տեղադրել ենթադրյալ DTEK տվյալների վրա:\n" +
                                    "Հաքերային խումբը հայտնվել է մարտին, ըստ ԱՄՆ-ի և դաշնակից կառավարության խորհրդատվական ծառայության, և հայտարարել է, որ թիրախավորում է ուկրաինացի պաշտոնյաներին՝ ի աջակցություն Ռուսաստանի պատերազմի:\n" +
                                    "XakNet-ը հասանելի է եղել մի կազմակերպությանը պատկանող տվյալներին, որը, հավանաբար, կոտրվել է ռուսական կիբերլրտեսական խմբի կողմից, ինչը ենթադրում է հնարավոր կապ XakNet-ի և Ռուսաստանի կառավարության միջև, ասել է Ալդեն Ուոլստրոմը՝ Mandiant ամերիկյան կիբերանվտանգության ընկերության ավագ վերլուծաբանը, որը հետաքննել է XakNet-ի որոշ դեպքեր: գործունեություն։\n" +
                                    "\n" +
                                    "\n" +
                                    "XakNet-ն իր Telegram ալիքում ծաղրել և հերքել է Ռուսաստանի կառավարության հետ համագործակցելու առաջարկը։\n" +
                                    "CNN-ը մեկնաբանություններ է խնդրել Վաշինգտոնում Ռուսաստանի դեսպանատնից։\n" +
                                    "Ցանցահենային միջադեպը համընկել է Ուկրաինայի կենտրոնական Կրիվի Ռիհ քաղաքում DTEK-ին պատկանող ՋԷԿ-ի ռուսական հրթիռակոծության հետ, ըստ DTEK-ի, որի կայքում ասվում է, որ այնտեղ աշխատում է 56,000 մարդ:\n" +
                                    "Microsoft-ը ապրիլյան զեկույցում փաստեց, որ ռուսական հաքերները երբեմն օգտագործվել են կինետիկ ռազմական հարվածների հետ միասին:\n" +
                                    "Ուկրաինական հեռարձակող ընկերության վրա կիբերհարձակում է տեղի ունեցել մարտի 1-ին, նույն օրը, երբ ռուսական հրթիռը հարվածեց Կիևի հեռուստաաշտարակին, ասվում է զեկույցում:\n" +
                                    "Ուկրաինական էներգակիրները մշտապես եղել են ռուսական հաքերային խմբերի թիրախը 2014 թվականին Ռուսաստանի կողմից Ղրիմը միացնելուց հետո:\n" +
                                    "Արդարադատության նախարարությունը մեղադրել է Ռուսաստանի ռազմական հետախուզության ծառայությանը 2015 և 2016 թվականներին էլեկտրատեխնիկական ձեռնարկությունների վրա կիբերհարձակումների համար, որոնք անջատել են էլեկտրաէներգիան Ուկրաինայի որոշ մասերում:\n" +
                                    "Նույն ռուսական հաքերային խումբը ապրիլին, իբր, թիրախավորել է էլեկտրական սարքավորումները Ուկրաինայում երկու միլիոն մարդկանց սպասարկող տարածքում, սակայն ուկրաինացի պաշտոնյաները պնդում են, որ հաքերային հարձակումը խափանվել է:\n" +
                                    "«Ընկերությունը գործադրում է բոլոր ջանքերը՝ պատերազմի ընթացքում Ուկրաինայի էներգահամակարգի կայուն աշխատանքն ապահովելու և ուկրաինացի սպառողներին էլեկտրաէներգիայի անխափան մատակարարում ապահովելու համար», - ասվում է ուրբաթ օրը DTEK-ի իր հայտարարության մեջ։",
                            isLessons = false
                        )
                    )
                    newList.add(
                        News(
                            title = "ՀԴԲ-ն ասում է, որ հյուսիսկորեացի հաքերները մեկ հաքերով գողացել են ավելի քան 800 միլիոն դոլար կրիպտոարժույթ",
                            image = R.drawable.lesson5,
                            description = "ապրիլի 15, 2022 թ\n" +
                                    "ՀԴԲ-ն մեղադրել է Հյուսիսային Կորեայի կառավարության հետ կապված հաքերներին՝ անցյալ ամիս վիդեո խաղերի ընկերությունից ավելի քան 810 միլիոն դոլարի կրիպտոարժույթ գողանալու համար, որը վերջինն է Փհենյանի հետ կապված կիբեր կողոպուտների շարքում:\n" +
                                    "«Մեր հետաքննության միջոցով մենք կարողացանք հաստատել, որ Lazarus Group-ը և APT38-ը՝ ԿԺԴՀ-ի հետ կապված կիբեր դերակատարները, պատասխանատու են մարտի 29-ին Ethereum-ից 620 միլիոն ԱՄՆ դոլարի գողության համար», - ասվում է ՀԴԲ-ի հայտարարության մեջ:\n" +
                                    "«ԿԺԴՀ»-ն Հյուսիսային Կորեայի պաշտոնական անվանման հապավումն է՝ Կորեայի Ժողովրդադեմոկրատական \u200B\u200BՀանրապետություն, իսկ Ethereum-ը տեխնոլոգիական հարթակ է, որը կապված է կրիպտոարժույթի տեսակի հետ:\n" +
                                    "\t\n" +
                                    "\n" +
                                    "ՀԴԲ-ն նկատի ուներ համակարգչային ցանցի վերջին կոտրումը, որն օգտագործվում էր Axie Infinity տեսախաղի կողմից, որը խաղացողներին թույլ է տալիս վաստակել կրիպտոարժույթ:\n" +
                                    "Sky Mavis ընկերությունը, որը ստեղծեց Axie Infinity-ն, մարտի 29-ին հայտարարեց, որ անհայտ հաքերները գողացել են մոտ 810 միլիոն դոլարին համարժեք գումար, որը գնահատվում էր հաքի հայտնաբերման պահին՝ մարտի 23-ին, «կամուրջից» կամ ցանցից, որը թույլ է տալիս օգտատերերին. ուղարկել կրիպտոարժույթ մեկ բլոկչեյնից մյուսը:\n" +
                                    "Հինգշաբթի օրը ԱՄՆ ֆինանսների նախարարությունը պատժամիջոցներ է կիրառել Lazarus Group-ի՝ \u200B\u200Bհաքերների լայն շրջանակի նկատմամբ, որը ենթադրաբար աշխատում է Հյուսիսային Կորեայի կառավարության անունից:\n" +
                                    "Գանձապետարանը պատժամիջոցներ է սահմանել հատուկ «դրամապանակի» կամ կրիպտոարժույթի հասցեի վրա, որն օգտագործվել է Axie Infinity հաքերից կանխիկացնելու համար:\n" +
                                    "Կիբերհարձակումները եղել են Հյուսիսային Կորեայի ռեժիմի եկամտի կարևոր աղբյուր տարիներ շարունակ, քանի որ նրա առաջնորդ Կիմ Չեն Ընը շարունակել է միջուկային զենքի հետապնդումը, ըստ ՄԱԿ-ի հանձնաժողովի և կիբերանվտանգության արտաքին փորձագետների:\n" +
                                    "\n" +
                                    "\n" +
                                    "Անցյալ ամիս Հյուսիսային Կորեան արձակեց այն, ինչը, ենթադրաբար, նրա առաջին միջմայրցամաքային բալիստիկ հրթիռն էր ավելի քան չորս տարվա ընթացքում:\n" +
                                    "Lazarus Group-ը վերջին տարիներին գողացել է մոտ 2,4 միլիարդ դոլար արժողությամբ կրիպտոարժույթ, ըստ Chainalysis ընկերության, որը հետևում է թվային արժույթով գործարքներին:\n" +
                                    "«Կրիպտոարժույթի բիզնեսի կոտրումը, ի տարբերություն մանրածախի, օրինակ, ըստ էության բանկի կողոպուտ է ինտերնետի արագությամբ և ֆինանսավորում է Հյուսիսային Կորեայի ապակայունացնող գործունեությունը և զենքի տարածումը», - ասում է TRM Labs ընկերության իրավական հարցերի ղեկավար Արի Ռեդբորդը: որը հետաքննում է ֆինանսական հանցագործությունները։\n" +
                                    "«Քանի դեռ նրանք հաջողակ են ու շահութաբեր, կանգ չեն առնելու»։\n" +
                                    "Թեև շատ կիբերանվտանգության վերլուծաբանների ուշադրությունը կենտրոնացած է ռուսական հաքերային հարձակումների վրա՝ ուկրաինական պատերազմի լույսի ներքո, Հյուսիսային Կորեայի կասկածյալ հաքերները հեռու են եղել լռությունից:\n" +
                                    "Անցյալ ամիս Google-ի հետազոտողները բացահայտեցին երկու տարբեր ենթադրյալ Հյուսիսային Կորեայի հաքերային արշավներ, որոնք ուղղված են ԱՄՆ ԶԼՄ-ների և ՏՏ կազմակերպություններին, կրիպտոարժույթների և ֆինանսական տեխնոլոգիաների ոլորտներին:\n" +
                                    "Google-ն ունի օգտատերերին ծանուցելու քաղաքականություն, որոնք թիրախ են հանդիսանում պետության կողմից հովանավորվող հաքերների կողմից:\n" +
                                    "\n" +
                                    "\n" +
                                    "Շեյն Հանթլին, ով ղեկավարում է Google-ի սպառնալիքների վերլուծության խումբը, ասում է, որ եթե Google-ի օգտատերը «բիթքոյնով կամ կրիպտոարժույթով ներգրավված լինելու որևէ կապ ունի», և նա նախազգուշացում է ստանում Google-ից պետության կողմից աջակցվող հաքերային հարձակման մասին, դա գրեթե միշտ ավարտվում է Հյուսիսային Կորեայի գործունեությունը: .\n" +
                                    "«Թվում է, որ նրանց համար շարունակական ռազմավարություն է՝ լրացնել և գումար վաստակել այս գործունեության միջոցով», - ասաց պարոն Հանթլին:",
                            isLessons = false
                        )
                    )
                    LazyColumn(
                        modifier = Modifier
                            .padding(12.dp)
                            .fillMaxHeight()
                            .fillMaxWidth(),
                    ) {
                        items(
                            if (args.isNews) {
                                newList
                            } else {
                                lessonsList
                            }
                        ) { newsItem ->
                            NewsItem(newsItem) {
                                val action =
                                    NewListFragmentDirections.actionNewListFragmentToImageWithTextFragment(
                                        newsItem
                                    )
                                findNavController().navigate(action)
                            }
                        }
                    }
                }
            }
        }
    }
}

@Composable
private fun NewsItem(news: News, onClick: () -> Unit) {
    Column(
        modifier = Modifier
            .fillMaxWidth()
            .padding(0.dp)
            .clickable { onClick() }
    ) {
        Image(
            painter = painterResource(id = news.image),
            contentDescription = null,
            modifier = Modifier.fillMaxWidth()
        )
        Text(
            text = news.title,
            modifier = Modifier
                .fillMaxWidth()
                .padding(8.dp),
            style = TextStyle(Color.White),
            maxLines = 2,
            overflow = TextOverflow.Ellipsis
        )
    }
}