package com.example.medialog.fragments.about

import android.os.Bundle
import android.view.LayoutInflater
import android.view.View
import android.view.ViewGroup
import androidx.compose.foundation.layout.Column
import androidx.compose.foundation.layout.fillMaxHeight
import androidx.compose.foundation.layout.fillMaxWidth
import androidx.compose.ui.Modifier
import androidx.compose.ui.platform.ComposeView
import androidx.fragment.app.Fragment
import com.example.medialog.fragments.Description
import com.example.medialog.fragments.ToolbarWithMenu

class AboutFragment : Fragment() {

    override fun onCreateView(
        inflater: LayoutInflater, container: ViewGroup?,
        savedInstanceState: Bundle?
    ): View {
        return ComposeView(requireContext()).apply {
            setContent {
                Column(
                    modifier = Modifier
                        .fillMaxHeight()
                        .fillMaxWidth()
                ) {
                    ToolbarWithMenu("About") {
                        requireActivity().onBackPressed()
                    }
                    Description(
                        text = "• Ի՞նչ  է իրենից ներկայացնում  MeDialog հավելվածը և  ի՞նչ նպատակ ունի այն։ \n" +
                                "\n" +
                                "MeDialog֊ը հավելված է,որը պատմում է մեդիայի, մեդիագրագիտության, դրա կարևորության,կիբերհանցագործությունների, մեդիասպառողների և այլնի մասին։ Այլ կերպ ասած ՝ ներառում է մեդիայի հետ առնօվող գրեթե ամեն ինչ։ MeDialogի նպատակն է ստանալ մեդիագրագետ  հասարակություն, որպեսզի խուսափենք  անդառնալի հետևանքներից՝ հօգուտ  հանցագործի և ի վնաս օգտատիրոջ։ \n" +
                                "\n" +
                                "• Ի՞նչ  գլուխներից է կազմված հավելվածը։\n" +
                                "Հավելվածը ներկայումս կազմված է 5 գլուխներից( հետագայում հավելելու միտումով) ՝\n" +
                                "1. Օնլայն գրադարան\n" +
                                "2. Վիդեո դասեր\n" +
                                "3. Թեստային աշխատանք\n" +
                                "4. Տեքստային նյութեր\n" +
                                "5. Quiz խաղեր \n" +
                                "\n" +
                                "Օնլայն գրադարանում ներառված են  մեդիագրագիտությանն առնչվող գրքեր։Այդ գրքերում ավելի խորը ուսումնասիրության են դրված  մեդիան և  մեդիագրագիտությունը։\n" +
                                "Վիդեոդասերն օգտագործվելու են նյութը ավելի պատկերավոր ներկայացնելու նպատակով։Տեքստային նյութը պարունակում է հիմնականում  առօրյային առնչվող մեդիա֊դեպքեր,իսկ թեստային աշխատանքն ու quiz խաղերը  հարցերի միջոցով ամրապնդում են  նախորդող 3 գլուխների նյութերը։\n" +
                                "\n" +
                                "\n" +
                                "• Ինչպե՞ս է ծագել MeDialog անվանումը։\n" +
                                "Անվան ծագումնաբանությունը կապված է  իրարից  ամբողջովին անկախ 3 բառարմատների հետ՝ me(ես) , media(մեդիա) և dialogue(երկխոսություն)։Հետևաբար MeDialog բառը արտացոլում է երկխոսությունը մարդու և մեդիայի միջև ։Եվքանի որ այժմ ապրում ենք տեղեկատվական քաոսի մեջ, եկեք գոնե այդ երկխոսությունը կազմակերպենք   մաքսիմալ ճիշտ և անսասան։ \n" +
                                "\n" +
                                "• Ովքե՞ր են հավելվածի հիմնական օգտատերերը(շահառուները)։ \n" +
                                "\n" +
                                "Հավելվածի հիմնական օգտատերերը 14֊18 տարեկան պատանիներն են։Այդ թիրախավորումը պայմանավորված է նրանով, որ այդ տարիքի դեռահասները բաց են նոր գիտելիքի համար, հեշտ են ընկալում և փոխանցում նյութը։Եվ նման թիրախավորումը մեզ հնարավորություն կտա 20֊30 տարի հետո ունենալ  տարեց  , համեմատաբար՝մեդիագրագետ  հասարակություն և հետագայում դա կպայմանավորի  նոր սերդնի արդեն իսկ կիրթ  լինելը մեդիա ոլորտում։ \n" +
                                "\n" +
                                "• Ի՞նչ կսովորի օգտատերը հավելվածի նյութերն ամբողջովին ուսումնասիրելու դեպքում։ \n" +
                                "\n" +
                                "Ուսումնառության  նյութերն ամբողջովին  սերտելու դեպքում  օգտատերը  կկարողանա  հեշտությամբ  տարբերել  կեղծ նյութը ճիշտ նյութից , ձեռք կբերի քննադատողական մտածողություն և  կզարգացնի սեփական տրամաբանությունը,  կկարողանա խուսափել կիբերհանցագործություններից(օր.՝ ֆիշինգ, թրոլինգ), հեշտությամբ չի տրվի սադրանքների և  խուճապի չի մատնվի ամեն պատահած նյութից։Եվ ամենավերջում պետք է նշել, որ նա կդառնա ինչպես գրագետ մեդիասպառող, այնպես էլ   գրագետ մեդիաարտադրող։  \n" +
                                "\n" +
                                "• Ովքե՞ր են  հավելվածի  հեղինակները և ի՞նչ գործառույթ են իրականացնում  նրանք։ \n" +
                                "\n" +
                                "Հավելվածի համահեղինակներն են  4  ակտիվ, իրենց համայնքի նկատմամբ սրտացավ  դեռահասներ(15֊16 տարեկան) ՝ Արմենը, Միլենան, Վաղարշակը և Սամվելը։Ինչպես բոլոր աշխատանքներում,այստեղ նույնպես յուրաքանչյուրն ունի իր յուրօրինակ գործառույթը։ Սամվելը, հետաքրքրված լինելով   նկարչությամբ և դիզայներական աշխատանքներով,   թիմում  հանդիսանում է դիզայնի  գծով  պատասխանատու առաջին ու գլխավոր անձը։Արմենը, հետաքրքրված լինելով մեդիա ոլորտով և  տեղեկատվությունը վերլուծելու յուրօրինակ կարողությամբ, ստանձնել է   հետաքրքիր, կարևոր և արդի նյութերը գտնողի, վերլուծողի և մշակողի պաշտոնը, այլ կերպ ասած՝ տեղեկույթի հավաստիության պատասխանատու։Վաղարշակը ստանձնել է ֆինանսական պատասխանատուի պաշտոնը , քանի որ  հեշտ է կարողանում ելքեր գտնել ֆինանսական անդունդներից , կարողանում է  ճիշտ վերլուծել գումարային տեղաշարժը։Թիմի միակ աղջնակը՝ Միլենան, հանդիսանում է   գովազդային արշավների պատասխանատուն,քանի որ հեշտ է  հաղորդակցվում մարդկանց հետ ,կարողանում է  վերլուծել մարդկանց և նրանց հոգեբանությունը։"
                    )
                }
            }
        }
    }
}